In [1]:
#PANDAS Library
import pandas as pd

In [3]:
df=pd.read_csv("student_dataset.csv")         # load CSV file

In [5]:
df.head()

   ID       Name  Age  Marks  Gender
0   1  Student_1   24     94    Male
1   2  Student_2   21     81  Female
2   3  Student_3   22     90    Male
3   4  Student_4   24     56  Female
4   5  Student_5   20     44  Female

In [6]:
df.tail()

       ID          Name  Age  Marks  Gender
995   996   Student_996   23     82  Female
996   997   Student_997   18     73  Female
997   998   Student_998   24     96  Female
998   999   Student_999   21     65    Male
999  1000  Student_1000   23     80    Male

In [9]:
df.shape

(1000, 5)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      1000 non-null   int64
 1   Name    1000 non-null   object
 2   Age     1000 non-null   int64
 3   Marks   1000 non-null   int64
 4   Gender  1000 non-null   object
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [11]:
df.dtypes

ID         int64
Name      object
Age        int64
Marks      int64
Gender    object
dtype: object

In [12]:
df.describe()

                ID        Age        Marks
count  1000.000000  1000.0000  1000.000000
mean    500.500000    20.9600    70.232000
std     288.819436     2.0036    17.468638
min       1.000000    18.0000    40.000000
25%     250.750000    19.0000    56.000000
50%     500.500000    21.0000    70.000000
75%     750.250000    23.0000    86.000000
max    1000.000000    24.0000   100.000000

In [14]:
df.columns

Index(['ID', 'Name', 'Age', 'Marks', 'Gender'], dtype='object')

In [16]:
df['Age'].mean()

np.float64(20.96)

In [17]:
df['Marks'].max()

np.int64(100)

In [19]:
df['ID'].min()

np.int64(1)

In [20]:
df['Marks'].median()

np.float64(70.0)

In [21]:
df['Marks'].sum()

np.int64(70232)

In [22]:
df['Age'].value_counts()

Age
21    156
18    156
22    148
24    138
19    137
23    135
20    130
Name: count, dtype: int64